---
type: DXFExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# DXFExportOptions

`Autodesk.Revit.DB.DXFExportOptions` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DXFExportOptions | — | `` |
| Constructor | DXFExportOptions | 2012 | `public DXFExportOptions ()` |
| Method | GetPredefinedOptions | 2012 | `public static DXFExportOptions GetPredefinedOptions ( Document document , string setup )` |